meeting/minutes/2022/12-13.org
:PROPERTIES:
:ID:       7795BC3F-6961-437A-BE6B-EE6EB8E9C7CB
:END:
#+title: QT4 CG Meeting 015 Minutes 2022-12-13
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

Approved [[./12-20.html][at meeting 016]] on 20 December 2022.

* Summary of new and continuing actions [0/7]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-014-01: MK to propose new ~try-get~ functions for arrays, maps, and (maybe) sequences
+ [ ] QT4CG-015-01: MK to change the name of the argument to =array:index-where= from =$input= to =$array=
+ [ ] QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views
+ [ ] QT4CG-015-03: NW to make sure the direction of the arrow is in the legend
+ [ ] QT4CG-015-04: NW to investigate of a dynamic presentation is practical
+ [ ] QT4CG-015-05: MK to raise a PR to resolve issue #107, self::(a|b|c)

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [7/14]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW, CG, RD, and EP.

+ [ ] Anthony (Tony) Bufort (AB)
+ [ ] Reece Dunn (RD)
+ [X] Sasha Firsov (SF)
+ [ ] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [0:25-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [ ] Ed Porter (EP)
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Scribe/. /Chair/.

Welcome Sasha Firsov. A brief round of introductions.

+ SF: I’m trying to be an open source contributor and web developer.
  Doing architectural work, trying to put some work on W3C in order to
  make decorated web applications a thing. When multiple
  applications from different vendors meet on the same page, there are
  technologies we need. Transformation is an essential part of that.
  I’m hoping to make a bridge between HTML DOM and XSLT communities.
+ NW: Works for Saxonica. Been doing XML since there was XML. I worked
  on the XProc specification.
+ JL: Spent seven years working for Saxonica. Wrote the XSLT versions of
  the XSLT and XPath 3 compilers in SaxonJS.
+ MSM: Got interested in declarative markup in the late 1980s. Worked
  on XML. Worked for W3C for a decade. Spent time on various working
  groups.
+ MK: I haven’t been in the game as long as NW and MSM, only about 20
  years. I’ve beeen developing Saxon all that time and became editor of the
  XSLT spec on version 2.0.
+ DN: I have been active in the XML space for maybe 20 years. Maybe
  I’m most well known for the FXSL library for XSLT 1.0 then 2.0. Did
  some presentations at conferences. I represented Microsoft on the
  XSLT WG, but for the last 10 years I’ve been actively pushing for
  pure XPath programming. You can see more about me by looking at the
  proposals I’ve submitted.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/12-13.html][the agenda]].

+ NW: We’ll skip the parse-html PR in RD’s absence.

+ DN: Two meetings ago, I was tasked with an action item, to clarify
  the way function arguments are evaluated when a function returns a
  function. I’d like to talk about issue #281.

Accepted with those amendments.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2022/12-20.html][is scheduled for Tuesday, 20 December]].

No regrets heard.

Reminder, the CG Will not meet on 27 December or 3 January.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/12-06.html][the minutes of the previous meeting]].

Accepted.

** Review of open action items [3/4]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
  + Continued
+ [ ] QT4CG-014-01: MK to propose new ~try-get~ functions for arrays, maps, and (maybe) sequences
  + Continued
+ [X] QT4CG-014-02: MK to draft a spec for ~array:exists()~ and ~array:empty()~ functions
+ [X] QT4CG-014-03: MK to update PR #250 with the new names

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

