meeting/minutes/2022/12-13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 015 Minutes 2022-12-13</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 015 Minutes 2022-12-13</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/7]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[7/14]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[3/4]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#issue-281">2.1. Issue 281</a></li>
<li><a href="#pr-array-index-where">2.2. Review pull request #258: add array:index-where (issue #114)</a></li>
<li><a href="#pr-parse-html">2.3. Review pull request #259: parse-html (issue #74)</a></li>
<li><a href="#pr-fn-char">2.4. Review pull request #261: fn:char (issue #121)</a></li>
<li><a href="#pr-type-diagrams">2.5. Review pull request #268: type diagrams (issue #265)</a></li>
<li><a href="#pr-xslt-function-override">2.6. Review pull request #279: Rewrite XSLT §10.3.4 (function overriding) for clarity</a></li>
<li><a href="#pr-grammar-if-then-else">2.7. Review pull request #284: Grammar for if-then w/o else</a></li>
<li><a href="#issue-170">2.8. Issue #170, XPath “otherwise” operator</a></li>
<li><a href="#issue-114">2.9. Issue #114, array:index-where</a></li>
<li><a href="#issue-107">2.10. Issue #107, allow self::(a|b|c)</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
<li><a href="#adjourned">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-014-01: MK to propose new <code>try-get</code> functions for arrays, maps, and (maybe) sequences</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-01: MK to change the name of the argument to <code>array:index-where</code> from <code>$input</code> to <code>$array</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-03: NW to make sure the direction of the arrow is in the legend</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-04: NW to investigate of a dynamic presentation is practical</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-015-05: MK to raise a PR to resolve issue #107, self::(a|b|c)</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[7/14]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, CG, RD, and EP.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Sasha Firsov (SF)</li>
<li class="off"><code>[&#xa0;]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [0:25-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="off"><code>[&#xa0;]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>

<p>
Welcome Sasha Firsov. A brief round of introductions.
</p>

<ul class="org-ul">
<li>SF: I’m trying to be an open source contributor and web developer.
Doing architectural work, trying to put some work on W3C in order to
make decorated web applications a thing. When multiple
applications from different vendors meet on the same page, there are
technologies we need. Transformation is an essential part of that.
I’m hoping to make a bridge between HTML DOM and XSLT communities.</li>
<li>NW: Works for Saxonica. Been doing XML since there was XML. I worked
on the XProc specification.</li>
<li>JL: Spent seven years working for Saxonica. Wrote the XSLT compiler
and XPath 3 compiler.</li>
<li>MSM: Got interested in declarative markup in the late 1980s. Worked
on XML. Worked for W3C for a decade. Spent time on various working
groups.</li>
<li>MK: I haven’t been in the game as long as NW and MSM, only about 20
years. I’ve beeen developing Saxon all that time and became editor of the
XSLT spec on version 2.0.</li>
<li>DN: I have been active in the XML space for maybe 20 years. Maybe
I’m most well known for the FXSL library for XSLT 1.0 then 2.0. Did
some presentations at conferences. I represented Microsoft on the
XSLT WG, but for the last 10 years I’ve been actively pushing for
pure XPath programming. You can see more about me by looking at the
proposals I’ve submitted.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/12-13.html">the agenda</a>.
</p>

<ul class="org-ul">
<li>NW: We’ll skip the parse-html PR in RD’s absence.</li>

<li>DN: Two meetings ago, I was tasked with an action item, to clarify
the way function arguments are evaluated when a function returns a
function. I’d like to talk about issue #281.</li>
</ul>

<p>
Accepted with those amendments.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/12-20.html">is scheduled for Tuesday, 20 December</a>.
</p>

<p>
No regrets heard.
</p>

<p>
Reminder, the CG Will not meet on 27 December or 3 January.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/12-06.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[3/4]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
<ul class="org-ul">
<li>Continued</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-014-01: MK to propose new <code>try-get</code> functions for arrays, maps, and (maybe) sequences
<ul class="org-ul">
<li>Continued</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-014-02: MK to draft a spec for <code>array:exists()</code> and <code>array:empty()</code> functions</li>
<li class="on"><code>[X]</code> QT4CG-014-03: MK to update PR #250 with the new names</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
