meeting/minutes/2022/12-13.org
** Issue 281
:PROPERTIES:
:CUSTOM_ID: issue-281
:END:

+ DN: Consider [[https://github.com/qt4cg/qtspecs/issues/281#issuecomment-1336491005][this comment]] on the issue: if, in =$f($x)($y)=, is it
  possible for =$y= to be evaluated before =$f($x)=? If =$f($x)=
  returns a constant function, is it still possible for =$y= to be
  evaulated? What do the current rules say?
+ MK: I’m reading section 4.4.2.1, evaluating dynamic function calls.
  Step 1 is to evaluate the base expression, =$f($x)= to get a
  function, then we ask if the arity matches the number in the
  argument list. It doesn’t so we raise a type error. Step 2 says that
  we evaluate the arguments. I think in a numbered list we assume the
  items are performed in the order of the list.
+ DN: There were new rules for coertion which were proposed. According
  to those rules, a type error would not be raised.
+ MK: There’s no coercion here because we’re not binding the result to
  a variable or function argument.
+ DN: But this is the result of the function, and coercion rules
  apply there too. So we’re expecting a 1 argument function and we get a
  0 argument function. That would be wrapped in a function.
+ MK: That would be true if they were applied, but I don’t think they
  are.
+ MSM: You’re (DN) saying that =$f($x)= is supposed to be a one
  argument function, then we’ll coerce it to be one. But we can’t know
  that here, so we won’t coerce it. Do we have a declaration for =$f=
  that it is a one argument function that returns a one argument
  function?
+ DN: My understanding is, the way the expression is written, it
  expects the evaulation of =$f= to return a one argument function. My
  understanding is that if it returns a constant function, we shouldn’t throw an
  arity expression. Maybe we should add a rule that there is no arity
  exception. This is explicitly writing a partial function evaluation.
+ SF: It’s about integrity of the language. There are a few different
  things. If =$f= returns another function or “none”, we could make
  the evaluation of =$y= conditional on that invocation. Consider
  JavaScript’s “?.”. Do you want =$x= and =$y= both to be evaluated?
  That’s a question for the programmer. If you do want to evaluate
  both, you would create a function that will accept arguments =$x=
  and =$y=, then invoke =$f= inside that. Quite often folks in
  software development, use the arguments just to assure that it’s
  evaluated. In JavaScript, you can use a comma separator which means
  everything will be evaluated.
+ DN: If you could add your comment to this thread, that might be
  easier to understand. I just wanted to pose the question, I think
  the right answer is that =$y= shouldn’t be evaluated until the result
  of =$f= is returned.
+ NW: I thought Mike’s prose was clear about the order, but it’s
  unclear about the arity.
+ MSM: Do we do lists in order?
+ MK: It’s certainly true that if the first raises an error, you don’t
  do the second.
+ MSM: Unless otherwise specified, shouldn’t an implementation be
  /allowed/ to evaluate =$y= greedily?
+ MK: We don’t have that level of formality in the specifications.
+ DN: I think this particular example should be in the specification.
+ NW: Let’s take this up again next week. Several folks who commented
  on the thread aren’t here today.
+ JL: I’ve been looking at 4.4.4, the function coercion rules, is DN
  suggesting that the type of the left hand thing is determined by the
  existence of the argument. Because it has a single arity, he’s
  implying that the function coercion rules apply, and I can’t see
  that.
+ DN: I’ve asked several times, if the coercion rules apply only to
  the function or to the return value. I’ve been consistently told
  that it applies to the return.
+ MK: But they only apply where there’s a declared required type. In
  this case, there’s an implicit requirement (like a + operator
  implicitly requires a number), but there isn’t an explicit type.
+ DN: Then my proposal is to think about changing the rules, because I
  think this is only logical. Why should we make any kind of exclusion
  from the rules here?
+ MK: It’s a tenable situation, we could apply that rule here.
+ MSM: If we declare =$f= as an arity one function that returns an
  arity one function, then presumably the coercion rules do apply.
+ DN: This seems like casting in C#.

Some further discussion of how the new corecion rules apply before
breaking off until next week.

** Review pull request #258: add array:index-where (issue #114)
:PROPERTIES:
:CUSTOM_ID: pr-array-index-where
:END:

See [[https://qt4cg.org/dashboard/#pr-258][pull request #258]]

Mike leads us through the change.

+ MK: There was a comment that =$input= should be named =$array=.

ACTION QT4CG-015-01: MK to change the name of the argument to =array:index-where= from =$input= to =$array=

Proposal: accept this PR with the name change.

Accepted.

** Review pull request #259: parse-html (issue #74)
:PROPERTIES:
:CUSTOM_ID: pr-parse-html
:END:

See [[https://qt4cg.org/dashboard/#pr-259][pull request #259]]

Skipped this week.

** Review pull request #261: fn:char (issue #121)
:PROPERTIES:
:CUSTOM_ID: pr-fn-char
:END:

See [[https://qt4cg.org/dashboard/#pr-261][pull request #261]]

Skipped this week.

** Review pull request #268: type diagrams (issue #265)
:PROPERTIES:
:CUSTOM_ID: pr-type-diagrams
:END:

See [[https://qt4cg.org/dashboard/#pr-268][pull request #268]]

Norm introduces the diagrams.

+ MK: It would be nice if they were scaled to fit.
+ NW: Yes, but then they’d illegible.
+ SF: There are other techniques that could be used to make them fit.
+ NW: Yes, but these are generated, so manual positioning isn’t a practical option.
+ DN: How about rotating the wide one 90 degrees?
+ NW: Maybe. But only if we rotate the text too, otherwise the first
  row is too wide.
+ MSM: Two suggestions and a question. For the first figure, make the
  lgend verical. The secondl ooks promising to me, I think you might
  be able to get what you need by specifying three ranks. My question
  is, what is the meaning of the directional arrow? I wonder if people
  will find it more intiutive if the arrow meant
  is-the-parent-of/basetype-of and went the other way.
+ NW: I did it that way because thaty’s the way they were in 3.1.

Some discussion of UML conventions.

+ MSM: I think arrows going the other way would be a little more
  intuitive, but the meaning of the directional arrow should be in
  the legend.
+ MK: UML does them that way, whether you like it or not
+ MSM: Okay.
+ JK: Maybe just do an XML tree for the really wide diagram?

Proposal: these diagrams are an improvement, accept this PR

Accepted

ACTION QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views
ACTION QT4CG-015-03: NW to make sure the direction of the arrow is in the legend

+ DN: There are a number of JavaScript controls that provide expanding
  and collapsing.

ACTION QT4CG-015-04: NW to investigate of a dynamic presentation is practical

