meeting/minutes/2022/12-13.html

<div id="outline-container-issue-281" class="outline-3">
<h3 id="issue-281"><span class="section-number-3">2.1.</span> Issue 281</h3>
<div class="outline-text-3" id="text-issue-281">
<ul class="org-ul">
<li>DN: Consider <a href="https://github.com/qt4cg/qtspecs/issues/281#issuecomment-1336491005">this comment</a> on the issue: if, in <code>$f($x)($y)</code>, is it
possible for <code>$y</code> to be evaluated before <code>$f($x)</code>? If <code>$f($x)</code>
returns a constant function, is it still possible for <code>$y</code> to be
evaulated? What do the current rules say?</li>
<li>MK: I’m reading section 4.4.2.1, evaluating dynamic function calls.
Step 1 is to evaluate the base expression, <code>$f($x)</code> to get a
function, then we ask if the arity matches the number in the
argument list. It doesn’t so we raise a type error. Step 2 says that
we evaluate the arguments. I think in a numbered list we assume the
items are performed in the order of the list.</li>
<li>DN: There were new rules for coertion which were proposed. According
to those rules, a type error would not be raised.</li>
<li>MK: There’s no coercion here because we’re not binding the result to
a variable or function argument.</li>
<li>DN: But this is the result of the function, and coercion rules
apply there too. So we’re expecting a 1 argument function and we get a
0 argument function. That would be wrapped in a function.</li>
<li>MK: That would be true if they were applied, but I don’t think they
are.</li>
<li>MSM: You’re (DN) saying that <code>$f($x)</code> is supposed to be a one
argument function, then we’ll coerce it to be one. But we can’t know
that here, so we won’t coerce it. Do we have a declaration for <code>$f</code>
that it is a one argument function that returns a one argument
function?</li>
<li>DN: My understanding is, the way the expression is written, it
expects the evaulation of <code>$f</code> to return a one argument function. My
understanding is that if it returns a constant function, we shouldn’t throw an
arity expression. Maybe we should add a rule that there is no arity
exception. This is explicitly writing a partial function evaluation.</li>
<li>SF: It’s about integrity of the language. There are a few different
things. If <code>$f</code> returns another function or “none”, we could make
the evaluation of <code>$y</code> conditional on that invocation. Consider
JavaScript’s “?.”. Do you want <code>$x</code> and <code>$y</code> both to be evaluated?
That’s a question for the programmer. If you do want to evaluate
both, you would create a function that will accept arguments <code>$x</code>
and <code>$y</code>, then invoke <code>$f</code> inside that. Quite often folks in
software development, use the arguments just to assure that it’s
evaluated. In JavaScript, you can use a comma separator which means
everything will be evaluated.</li>
<li>DN: If you could add your comment to this thread, that might be
easier to understand. I just wanted to pose the question, I think
the right answer is that <code>$y</code> shouldn’t be evaluated until the result
of <code>$f</code> is returned.</li>
<li>NW: I thought Mike’s prose was clear about the order, but it’s
unclear about the arity.</li>
<li>MSM: Do we do lists in order?</li>
<li>MK: It’s certainly true that if the first raises an error, you don’t
do the second.</li>
<li>MSM: Unless otherwise specified, shouldn’t an implementation be
<i>allowed</i> to evaluate <code>$y</code> greedily?</li>
<li>MK: We don’t have that level of formality in the specifications.</li>
<li>DN: I think this particular example should be in the specification.</li>
<li>NW: Let’s take this up again next week. Several folks who commented
on the thread aren’t here today.</li>
<li>JL: I’ve been looking at 4.4.4, the function coercion rules, is DN
suggesting that the type of the left hand thing is determined by the
existence of the argument. Because it has a single arity, he’s
implying that the function coercion rules apply, and I can’t see
that.</li>
<li>DN: I’ve asked several times, if the coercion rules apply only to
the function or to the return value. I’ve been consistently told
that it applies to the return.</li>
<li>MK: But they only apply where there’s a declared required type. In
this case, there’s an implicit requirement (like a + operator
implicitly requires a number), but there isn’t an explicit type.</li>
<li>DN: Then my proposal is to think about changing the rules, because I
think this is only logical. Why should we make any kind of exclusion
from the rules here?</li>
<li>MK: It’s a tenable situation, we could apply that rule here.</li>
<li>MSM: If we declare <code>$f</code> as an arity one function that returns an
arity one function, then presumably the coercion rules do apply.</li>
<li>DN: This seems like casting in C#.</li>
</ul>

<p>
Some further discussion of how the new corecion rules apply before
breaking off until next week.
</p>
</div>
</div>

<div id="outline-container-pr-array-index-where" class="outline-3">
<h3 id="pr-array-index-where"><span class="section-number-3">2.2.</span> Review pull request #258: add array:index-where (issue #114)</h3>
<div class="outline-text-3" id="text-pr-array-index-where">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-258">pull request #258</a>
</p>

<p>
Mike leads us through the change.
</p>

<ul class="org-ul">
<li>MK: There was a comment that <code>$input</code> should be named <code>$array</code>.</li>
</ul>

<p>
ACTION QT4CG-015-01: MK to change the name of the argument to <code>array:index-where</code> from <code>$input</code> to <code>$array</code>
</p>

<p>
Proposal: accept this PR with the name change.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-parse-html" class="outline-3">
<h3 id="pr-parse-html"><span class="section-number-3">2.3.</span> Review pull request #259: parse-html (issue #74)</h3>
<div class="outline-text-3" id="text-pr-parse-html">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-259">pull request #259</a>
</p>

<p>
Skipped this week.
</p>
</div>
</div>

<div id="outline-container-pr-fn-char" class="outline-3">
<h3 id="pr-fn-char"><span class="section-number-3">2.4.</span> Review pull request #261: fn:char (issue #121)</h3>
<div class="outline-text-3" id="text-pr-fn-char">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-261">pull request #261</a>
</p>

<p>
Skipped this week.
</p>
</div>
</div>

<div id="outline-container-pr-type-diagrams" class="outline-3">
<h3 id="pr-type-diagrams"><span class="section-number-3">2.5.</span> Review pull request #268: type diagrams (issue #265)</h3>
<div class="outline-text-3" id="text-pr-type-diagrams">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-268">pull request #268</a>
</p>

<p>
Norm introduces the diagrams.
</p>

<ul class="org-ul">
<li>MK: It would be nice if they were scaled to fit.</li>
<li>NW: Yes, but then they’d illegible.</li>
<li>SF: There are other techniques that could be used to make them fit.</li>
<li>NW: Yes, but these are generated, so manual positioning isn’t a practical option.</li>
<li>DN: How about rotating the wide one 90 degrees?</li>
<li>NW: Maybe. But only if we rotate the text too, otherwise the first
row is too wide.</li>
<li>MSM: Two suggestions and a question. For the first figure, make the
lgend verical. The secondl ooks promising to me, I think you might
be able to get what you need by specifying three ranks. My question
is, what is the meaning of the directional arrow? I wonder if people
will find it more intiutive if the arrow meant
is-the-parent-of/basetype-of and went the other way.</li>
<li>NW: I did it that way because thaty’s the way they were in 3.1.</li>
</ul>

<p>
Some discussion of UML conventions.
</p>

<ul class="org-ul">
<li>MSM: I think arrows going the other way would be a little more
intuitive, but the meaning of the directional arrow should be in
the legend.</li>
<li>MK: UML does them that way, whether you like it or not</li>
<li>MSM: Okay.</li>
<li>JK: Maybe just do an XML tree for the really wide diagram?</li>
</ul>

<p>
Proposal: these diagrams are an improvement, accept this PR
</p>

<p>
Accepted
</p>

<p>
ACTION QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views
ACTION QT4CG-015-03: NW to make sure the direction of the arrow is in the legend
</p>

<ul class="org-ul">
<li>DN: There are a number of JavaScript controls that provide expanding
and collapsing.</li>
</ul>

<p>
ACTION QT4CG-015-04: NW to investigate of a dynamic presentation is practical
</p>
</div>
</div>
