meeting/minutes/2022/12-13.org
** Review pull request #279: Rewrite XSLT §10.3.4 (function overriding) for clarity
:PROPERTIES:
:CUSTOM_ID: pr-xslt-function-override
:END:

See [[https://qt4cg.org/dashboard/#pr-279][pull request #279]]

+ MK: This is just an attempt to clarify the presentation; there
  aren’t any tehcnical changes.
  + … We’ve taken a section that bundled together three things about
    overriding and made them separate.
  + … There are rules about package import precedence, extension
    functions, and then override in a used package.

Proosal: Accept this PR.

Accepted.

** Review pull request #284: Grammar for if-then w/o else
:PROPERTIES:
:CUSTOM_ID: pr-grammar-if-then-else
:END:

See [[https://qt4cg.org/dashboard/#pr-284][pull request #284]]

Skipped this week.

** Issue #170, XPath “otherwise” operator
:PROPERTIES:
:CUSTOM_ID: issue-170
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/170][this issue]] may be ready to be decided.

+ MK: Does anyone remember why we postponed this issue? There’s no
  explicit action waiting to be done.

No, we don’t. NW to make sure it’s higher on the agenda next week.

** Issue #114, array:index-where
:PROPERTIES:
:CUSTOM_ID: issue-114
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/114][this issue]] may be ready to be decided

Resolved by the earlier PR.

** Issue #107, allow self::(a|b|c)
:PROPERTIES:
:CUSTOM_ID: issue-107
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/107][this issue]] may be ready to be decided.

+ MK: Is this worth doing? I don’t want to spend the time on the PR
  unless there’s general agreement that it’s a good idea.
+ MSM: How much violence does this do to the grammar?
+ MK: Not much, it just allows a union.
+ MSM: As long as we can be sure it isn’t ambiguious.

ACTION QT4CG-015-05: MK to raise a PR to resolve issue #107, self::(a|b|c)

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:
