meeting/minutes/2022/12-13.html

<div id="outline-container-pr-xslt-function-override" class="outline-3">
<h3 id="pr-xslt-function-override"><span class="section-number-3">2.6.</span> Review pull request #279: Rewrite XSLT §10.3.4 (function overriding) for clarity</h3>
<div class="outline-text-3" id="text-pr-xslt-function-override">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-279">pull request #279</a>
</p>

<ul class="org-ul">
<li>MK: This is just an attempt to clarify the presentation; there
aren’t any tehcnical changes.
<ul class="org-ul">
<li>… We’ve taken a section that bundled together three things about
overriding and made them separate.</li>
<li>… There are rules about package import precedence, extension
functions, and then override in a used package.</li>
</ul></li>
</ul>

<p>
Proosal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-grammar-if-then-else" class="outline-3">
<h3 id="pr-grammar-if-then-else"><span class="section-number-3">2.7.</span> Review pull request #284: Grammar for if-then w/o else</h3>
<div class="outline-text-3" id="text-pr-grammar-if-then-else">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-284">pull request #284</a>
</p>

<p>
Skipped this week.
</p>
</div>
</div>

<div id="outline-container-issue-170" class="outline-3">
<h3 id="issue-170"><span class="section-number-3">2.8.</span> Issue #170, XPath “otherwise” operator</h3>
<div class="outline-text-3" id="text-issue-170">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/170">this issue</a> may be ready to be decided.
</p>

<ul class="org-ul">
<li>MK: Does anyone remember why we postponed this issue? There’s no
explicit action waiting to be done.</li>
</ul>

<p>
No, we don’t. NW to make sure it’s higher on the agenda next week.
</p>
</div>
</div>

<div id="outline-container-issue-114" class="outline-3">
<h3 id="issue-114"><span class="section-number-3">2.9.</span> Issue #114, array:index-where</h3>
<div class="outline-text-3" id="text-issue-114">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/114">this issue</a> may be ready to be decided
</p>

<p>
Resolved by the earlier PR.
</p>
</div>
</div>

<div id="outline-container-issue-107" class="outline-3">
<h3 id="issue-107"><span class="section-number-3">2.10.</span> Issue #107, allow self::(a|b|c)</h3>
<div class="outline-text-3" id="text-issue-107">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/107">this issue</a> may be ready to be decided.
</p>

<ul class="org-ul">
<li>MK: Is this worth doing? I don’t want to spend the time on the PR
unless there’s general agreement that it’s a good idea.</li>
<li>MSM: How much violence does this do to the grammar?</li>
<li>MK: Not much, it just allows a union.</li>
<li>MSM: As long as we can be sure it isn’t ambiguious.</li>
</ul>

<p>
ACTION QT4CG-015-05: MK to raise a PR to resolve issue #107, self::(a|b|c)
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>
